3.org
#+TITLE: 协作命令
#+SETUPFILE: ./resource/template.org

* 在本章：
*症状*
*解药*
*归纳出更一般的解决方法*

本章将讲述不同命令协同工作，以完成在一个命令里保存信息而在另一个命令里获取它。共享信息的最简单的方式是创建一个变量并把值存进去。本章中我们当然也会这么做。例如，我们会把当前buffer中的位置信息存储起来然后在其他命令中使用它。但是我们也会学到一些更复杂的保存状态的方式，特别是标记（markers）和符号属性（symbol properties）。我们将会把这些跟buffer和窗口的信息组合起来写出一套允许你“回滚”翻页动作的函数。

* 症状
你正在编写一些复杂的Lisp代码。你非常专注，在头脑中努力的理清数据之间的微妙的联系然后将它们编写到屏幕上。你正在处理一个非常精妙的部分而这时你发现了左面的一个拼写错误。你希望按下C-b C-b C-b来回到那里对其修正，但是--灾难发生了--你按下了C-v C-v C-v，向下翻了三屏，最终停在了离你的代码几光年以外的地方。你试图找到在这个失误发生之前光标在哪里，以及为什么在那里，以及你正在那里做什么，这无疑打乱了你头脑中的思考。当你翻页，或者搜索，或者查找撤销列表来回到那里时，你已经忘了最初想要修正的那个拼写错误，最终这变成了一个bug，可能会花费你几个小时来找到它。

Emacs在这个例子中没有起到帮助作用。它使你如此容易的在你的文档中迷失而找到回去的路却很困难。虽然Emacs有一个可扩展的撤销工具，但这只能撤销修改。你不能撤销如此简单的浏览行为。

* 解药
假设我们可以这样修改C-v（scroll-up命令[[[3-16][16]]]），当我们按下它之后，Emacs认为，“可能用户是误按的C-v，所以我将记录一些‘撤销’的信息以备未来需要”。然后我们可以编写另一个函数，unscroll，它可以回滚最后一次的滚动。这样只要记住unscroll的按键绑定就能避免再次发生这种迷失。

实际上这并没完全解决问题。如果你一次按下了多个C-v，调用一次unscroll应该将它们都撤销，而不是只撤销最后一次。这表示只有序列中的第一个C-v才需要记住它的起始位置。我们怎样来检测这种情况的发生呢？在我们的C-v代码里记录开始位置之前，我们需要知道（a）下一个命令是否还是scroll-up，或者（b）前一个命令是否不是scroll-up。显然（a）是不可能的：我们不能预见未来。幸运的是（b）很简单：Emacs有一个称为last-command的变量专门记录这一信息。这个变量是我们将使用的在不同命令间传递信息的第一个方法。

现在唯一剩下的问题是：我们如何把这个额外的代码关联到scroll-up？修饰特性能很好的解决这一问题。前面讲过一段修饰代码可以在被修饰方法之前或之后执行。在本例中我们需要前置修饰，因为只有在执行scroll-up之前我们才能知道开始的位置在哪里。

** 声明变量
我们将以建立一个保存“撤销”信息的全局变量unscorll-to开始，它保存了unscroll应该将光标移动到的位置。我们将使用defvar来声明变量。
#+BEGIN_SRC emacs-lisp
  (defvar unscroll-to nil
    "Text position for next call to 'unscroll'.")
#+END_SRC

全局变量不需要声明。但是使用defvar声明变量有一些优势：
+ 使用defvar能够关联一个文档字符串给变量，就像defun那样。
+ 可以给变量赋一个默认值。本例中，unscroll-to的默认值是nil。

  通过defvar给变量赋默认值与使用setq不一样。使用setq将会强制给变量赋默认值，而defvar只会在变量没有任何值时才会赋给默认值。
  
  为什么这很重要呢？假设你的.emacs文件有这么一行：
  #+BEGIN_SRC emacs-lisp
    (setq mail-signature t)
  #+END_SRC
  
  这表示当你使用Emacs发送email时，你希望在最后添加你自己的签名文件。当你启动Emacs时，mail-signature被设置为了t，但是定义邮件发送代码的Lisp文件，sendmail，还没有被载入。它只有当你第一次调用mail命令时才会加载。当你调用mail时，Emacs将执行sendmail Lisp文件中的代码：  
  #+BEGIN_SRC emacs-lisp
    (defvar mail-signature nil ...)
  #+END_SRC
  
  这表示nil是mail-signature的默认初始值。但是你已经给mail-signature赋过值了，而你不希望载入sendmail时把你的设置给覆盖了。另一方面，如果你在.emacs中并没有给mail-signature赋过任何值，你还是希望这个值能够生效。
+ 使用defvar声明的变量可以通过多个标签相关（tag-related）的命令找到。在工程中通过标签找到变量和函数定义是一种快捷的方式。Emacs的标签工具，例如find-tag函数，可以找到任何通过def...函数(defun, defalias, defmacro, defvar, defsubst, defconst, defadvice)定义的东西。
+ 当你编译字节码时（见[[file:./5.org][第五章]]），编译器如果发现变量未使用defvar声明将会产生一个警告。如果你的所有变量都进行了声明，那么你可以使用这些警告来找出哪些变量名写错了。

** 保存和取出point
让我们定义一个变量来存储scroll-up队列的最初位置，即最初光标在文本中的位置。光标在文本中的位置被称为point，其值就是从buffer开始位置计算（从1开始）有多少个字符。point的值可以由函数point得到。

#+BEGIN_SRC emacs-lisp
  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (eq last-command 'scroll-up))
        (setq unscroll-to (point))))
#+END_SRC

这个修饰是这么工作的：

1. 函数eq告诉我们它的两个参数是否相等。本例中，参数是last-command变量的值，以及符号scroll-up。last-command的值是最后一次用户触发的命令的符号（在本章后面的部分[[使用this-command][使用this-command]]中也能看到）。
2. eq的返回值被传递给not，这会对它的参数的布尔值取反。如果nil传给not，那么返回t。如果其他值传给not，则返回nil。[[[3-17][17]]]
3. 如果not的返回值是t，即last-command的值并不是scroll-up，那么变量unscroll-to的的值将被设置为当前的point值。

现在定义unscroll就很简单了：
#+BEGIN_SRC emacs-lisp
  (defun unscroll ()
    "Jump to location specified by 'unscroll-to'."
    (interactive)
    (goto-char unscroll-to))
#+END_SRC

函数goto-char将光标移动到指定的位置。

