html/3.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-27 Tue 09:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>协作命令</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shuai Zhao" />
<link rel="stylesheet" type="text/css" href="../resource/org.css" />
</head>
<body>
<div id="content">
<h1 class="title">协作命令</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org570683a">1. 在本章：</a></li>
<li><a href="#org2dd82a7">2. 症状</a></li>
<li><a href="#orgf1d4572">3. 解药</a>
<ul>
<li><a href="#org4f4ea51">3.1. 声明变量</a></li>
<li><a href="#org00b5b4a">3.2. 保存和取出point</a></li>
<li><a href="#org7d3e1b3">3.3. 窗口内容</a></li>
<li><a href="#org1fdcf58">3.4. 错误检查</a></li>
</ul>
</li>
<li><a href="#org5fda8ce">4. 归纳出更一般的解决方法</a>
<ul>
<li><a href="#org8be47d2">4.1. 使用this-command</a></li>
<li><a href="#org47d3ab1">4.2. 符号属性</a></li>
<li><a href="#orgcc9dd04">4.3. 标记</a></li>
<li><a href="#orgda20e7a">4.4. 附录：关于效率</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org570683a" class="outline-2">
<h2 id="org570683a"><span class="section-number-2">1</span> 在本章：</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>症状</b><br />
<b>解药</b><br />
<b>归纳出更一般的解决方法</b><br />
</p>

<p>
本章将讲述不同命令协同工作，以完成在一个命令里保存信息而在另一个命令里获取它。共享信息的最简单的方式是创建一个变量并把值存进去。本章中我们当然也会这么做。例如，我们会把当前buffer中的位置信息存储起来然后在其他命令中使用它。但是我们也会学到一些更复杂的保存状态的方式，特别是标记（markers）和符号属性（symbol properties）。我们将会把这些跟buffer和窗口的信息组合起来写出一套允许你“回滚”翻页动作的函数。<br />
</p>
</div>
</div>

<div id="outline-container-org2dd82a7" class="outline-2">
<h2 id="org2dd82a7"><span class="section-number-2">2</span> 症状</h2>
<div class="outline-text-2" id="text-2">
<p>
你正在编写一些复杂的Lisp代码。你非常专注，在头脑中努力的理清数据之间的微妙的联系然后将它们编写到屏幕上。你正在处理一个非常精妙的部分而这时你发现了左面的一个拼写错误。你希望按下C-b C-b C-b来回到那里对其修正，但是&#x2013;灾难发生了&#x2013;你按下了C-v C-v C-v，向下翻了三屏，最终停在了离你的代码几光年以外的地方。你试图找到在这个失误发生之前光标在哪里，以及为什么在那里，以及你正在那里做什么，这无疑打乱了你头脑中的思考。当你翻页，或者搜索，或者查找撤销列表来回到那里时，你已经忘了最初想要修正的那个拼写错误，最终这变成了一个bug，可能会花费你几个小时来找到它。<br />
</p>

<p>
Emacs在这个例子中没有起到帮助作用。它使你如此容易的在你的文档中迷失而找到回去的路却很困难。虽然Emacs有一个可扩展的撤销工具，但这只能撤销修改。你不能撤销如此简单的浏览行为。<br />
</p>
</div>
</div>

<div id="outline-container-orgf1d4572" class="outline-2">
<h2 id="orgf1d4572"><span class="section-number-2">3</span> 解药</h2>
<div class="outline-text-2" id="text-3">
<p>
假设我们可以这样修改C-v（scroll-up命令[<a href="#orgfbd84c3">16</a>]），当我们按下它之后，Emacs认为，“可能用户是误按的C-v，所以我将记录一些‘撤销’的信息以备未来需要”。然后我们可以编写另一个函数，unscroll，它可以回滚最后一次的滚动。这样只要记住unscroll的按键绑定就能避免再次发生这种迷失。<br />
</p>

<p>
实际上这并没完全解决问题。如果你一次按下了多个C-v，调用一次unscroll应该将它们都撤销，而不是只撤销最后一次。这表示只有序列中的第一个C-v才需要记住它的起始位置。我们怎样来检测这种情况的发生呢？在我们的C-v代码里记录开始位置之前，我们需要知道（a）下一个命令是否还是scroll-up，或者（b）前一个命令是否不是scroll-up。显然（a）是不可能的：我们不能预见未来。幸运的是（b）很简单：Emacs有一个称为last-command的变量专门记录这一信息。这个变量是我们将使用的在不同命令间传递信息的第一个方法。<br />
</p>

<p>
现在唯一剩下的问题是：我们如何把这个额外的代码关联到scroll-up？修饰特性能很好的解决这一问题。前面讲过一段修饰代码可以在被修饰方法之前或之后执行。在本例中我们需要前置修饰，因为只有在执行scroll-up之前我们才能知道开始的位置在哪里。<br />
</p>
</div>

<div id="outline-container-org4f4ea51" class="outline-3">
<h3 id="org4f4ea51"><span class="section-number-3">3.1</span> 声明变量</h3>
<div class="outline-text-3" id="text-3-1">
<p>
我们将以建立一个保存“撤销”信息的全局变量unscorll-to开始，它保存了unscroll应该将光标移动到的位置。我们将使用defvar来声明变量。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscroll-to</span> nil
  <span style="color: #75715E;">"Text position for next call to 'unscroll'."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
全局变量不需要声明。但是使用defvar声明变量有一些优势：<br />
</p>
<ul class="org-ul">
<li>使用defvar能够关联一个文档字符串给变量，就像defun那样。<br /></li>
<li><p>
可以给变量赋一个默认值。本例中，unscroll-to的默认值是nil。<br />
</p>

<p>
通过defvar给变量赋默认值与使用setq不一样。使用setq将会强制给变量赋默认值，而defvar只会在变量没有任何值时才会赋给默认值。<br />
</p>

<p>
为什么这很重要呢？假设你的.emacs文件有这么一行：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp">&#8232;&#8232;<span style="color: #AE81FF;">(</span><span style="color: #F92672;">setq</span> mail-signature t<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这表示当你使用Emacs发送email时，你希望在最后添加你自己的签名文件。当你启动Emacs时，mail-signature被设置为了t，但是定义邮件发送代码的Lisp文件，sendmail，还没有被载入。它只有当你第一次调用mail命令时才会加载。当你调用mail时，Emacs将执行sendmail Lisp文件中的代码：  <br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">mail-signature</span> nil ...<span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这表示nil是mail-signature的默认初始值。但是你已经给mail-signature赋过值了，而你不希望载入sendmail时把你的设置给覆盖了。另一方面，如果你在.emacs中并没有给mail-signature赋过任何值，你还是希望这个值能够生效。<br />
</p></li>
<li>使用defvar声明的变量可以通过多个标签相关（tag-related）的命令找到。在工程中通过标签找到变量和函数定义是一种快捷的方式。Emacs的标签工具，例如find-tag函数，可以找到任何通过def&#x2026;函数(defun, defalias, defmacro, defvar, defsubst, defconst, defadvice)定义的东西。<br /></li>
<li>当你编译字节码时（见<a href="./5.html">第五章</a>），编译器如果发现变量未使用defvar声明将会产生一个警告。如果你的所有变量都进行了声明，那么你可以使用这些警告来找出哪些变量名写错了。<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org00b5b4a" class="outline-3">
<h3 id="org00b5b4a"><span class="section-number-3">3.2</span> 保存和取出point</h3>
<div class="outline-text-3" id="text-3-2">
<p>
让我们定义一个变量来存储scroll-up队列的最初位置，即最初光标在文本中的位置。光标在文本中的位置被称为point，其值就是从buffer开始位置计算（从1开始）有多少个字符。point的值可以由函数point得到。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-up</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                             activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span>eq last-command 'scroll-up<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-to <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这个修饰是这么工作的：<br />
</p>

<ol class="org-ol">
<li>函数eq告诉我们它的两个参数是否相等。本例中，参数是last-command变量的值，以及符号scroll-up。last-command的值是最后一次用户触发的命令的符号（在本章后面的部分<a href="#org8be47d2">使用this-command</a>中也能看到）。<br /></li>
<li>eq的返回值被传递给not，这会对它的参数的布尔值取反。如果nil传给not，那么返回t。如果其他值传给not，则返回nil。[<a href="#orgd200d21">17</a>]<br /></li>
<li>如果not的返回值是t，即last-command的值并不是scroll-up，那么变量unscroll-to的的值将被设置为当前的point值。<br /></li>
</ol>

<p>
现在定义unscroll就很简单了：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">unscroll</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Jump to location specified by 'unscroll-to'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char unscroll-to<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
函数goto-char将光标移动到指定的位置。<br />
</p>
</div>
</div>
