3.org
** 窗口内容
对于这个解决方案有一些不完美的地方。在一次unscroll之后，光标确实返回到了正确的地方，但这时屏幕却看起来和按下C-v之前不一样了。例如，我在按下C-v C-v C-v之前可能正在屏幕的底部编辑一行代码。在我调用unscroll之后，虽然光标确实回到了之前的位置，但是那一行可能显示到了窗口的中间。

既然我们的目的是最小化意料之外的滚动所造成的破坏，那么我们不只希望仅仅恢复光标的位置，我们还希望之前编辑的行的位置也恢复到原处。

因此只保存point的值就不够了。我们还必须保存一个值来表示当前窗口中显示什么。Emacs提供了几个函数来描述窗口中显示什么，例如window-edges，window-height，current-window-configuration。目前我们只需要使用window-start，它表示对于给定的窗口，显示的第一个（窗口左上角）字符在buffer中的位置。这样我们只需要在命令间传递更多一点信息就可以了。

更新我们的例子很简单。首相我们要将变量unscroll-to的声明替换为两个新的变量：一个用于保存point的值，另一个用于保存窗口中第一个字符的位置。
#+BEGIN_SRC emacs-lisp
  (defvar unscroll-point nil
    "Cursor position for next call to 'unscroll'.")
    
  (defvar unscroll-window-start nil
    "Window start for next call to 'unscroll'.")
#+END_SRC

然后我们要修改scroll-up的修饰以及unscroll来使用这两个值。
#+BEGIN_SRC emacs-lisp
  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for ‘unscroll'."
    (if (not (eq last-command 'scroll-up))
        (progn
          (setq unscroll-point (point))
          (setq unscroll-window-start (window-start)))))

  (defun unscroll ()
    "Revert to 'unscroll-point' and 'unscroll-window-start'."
    (interactive)
    (goto-char unscroll-point)
    (set-window-start nil unscroll-window-start))
#+END_SRC

修饰的名称仍然是remember-for-unscroll，这会替换之前同名的修饰。

函数set-window-start和goto-char移动光标位置的方式类似，它会设置窗口开始的位置。不一样的是，set-window-start有两个参数。第一个参数表明操作的是哪个窗口。如果为nil，则默认使用当前选中的窗口。（传递给set-window-start的窗口对象可以通过类似get-buffer-window以及previous-window的函数得到。）

对于回滚我们可能还希望保持另一个信息，即窗口的hscroll，它保存着窗口横向翻滚的列数，默认为0 。我们可以添加另一个变量来保存：
#+BEGIN_SRC emacs-lisp
  (defvar unscroll-hscroll nil
    "Hscroll for next call to 'unscroll'.")
#+END_SRC

然后我们再次更新unscroll和scroll-up修饰来调用window-hscroll（获取窗口的hscroll值）以及set-window-hscroll（设置）：
#+BEGIN_SRC emacs-lisp
  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (eq last-command 'scroll-up))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defun unscroll ()
    "Revert to 'unscroll-point' and 'unscroll-window-start'."
    (interactive)
    (goto-char unscroll-point)
    (set-window-start nil unscroll-window-start)
    (set-window-hscroll nil unscroll-hscroll))
#+END_SRC

注意在这个scroll-up修饰的版本中，progn的使用：
#+BEGIN_SRC emacs-lisp
  (progn
    (setq ...)
    (setq ...))
#+END_SRC

被合并成了一个setq，里面包含了多个“变量-值”对。这是一种简化写法，setq可以包含任意数量的变量。

** 错误检查
假如用户在调用任何scroll-up之前调用了unscroll会发生什么呢？变量unscroll-point，unscroll-window-start，以及unscroll-scroll将会包含他们的默认值，也就是nil。这个值在传递给函数goto-char，set-window-start以及set-window-scroll时是不合适的。当goto-char被调用时，unscroll的触发将会返回如下错误：“Wrong type argument: integer-or-maker-p, nil”。这表示一个函数需要接收一个数字或者标记（满足断言integer-or-marker-p），而收到的却是nil。（标记在本章前面的部分介绍过了。）

为避免用户被这些神秘的错误信息所折磨，在调用goto-char之前进行一个简单的检查并且生成一个更可读的错误信息是一个好主意：
#+BEGIN_SRC emacs-lisp
  (if (not unscroll-point) ; 如果unscroll-point的值为nil
      (error "Cannot unscroll yet"))
#+END_SRC

当错误发生时，unscroll将会被终止并且提示“Cannot unscroll yet”。

