html/3.html

<div id="outline-container-org7d3e1b3" class="outline-3">
<h3 id="org7d3e1b3"><span class="section-number-3">3.3</span> 窗口内容</h3>
<div class="outline-text-3" id="text-3-3">
<p>
对于这个解决方案有一些不完美的地方。在一次unscroll之后，光标确实返回到了正确的地方，但这时屏幕却看起来和按下C-v之前不一样了。例如，我在按下C-v C-v C-v之前可能正在屏幕的底部编辑一行代码。在我调用unscroll之后，虽然光标确实回到了之前的位置，但是那一行可能显示到了窗口的中间。<br />
</p>

<p>
既然我们的目的是最小化意料之外的滚动所造成的破坏，那么我们不只希望仅仅恢复光标的位置，我们还希望之前编辑的行的位置也恢复到原处。<br />
</p>

<p>
因此只保存point的值就不够了。我们还必须保存一个值来表示当前窗口中显示什么。Emacs提供了几个函数来描述窗口中显示什么，例如window-edges，window-height，current-window-configuration。目前我们只需要使用window-start，它表示对于给定的窗口，显示的第一个（窗口左上角）字符在buffer中的位置。这样我们只需要在命令间传递更多一点信息就可以了。<br />
</p>

<p>
更新我们的例子很简单。首相我们要将变量unscroll-to的声明替换为两个新的变量：一个用于保存point的值，另一个用于保存窗口中第一个字符的位置。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscroll-point</span> nil
  <span style="color: #75715E;">"Cursor position for next call to 'unscroll'."</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscroll-window-start</span> nil
  <span style="color: #75715E;">"Window start for next call to 'unscroll'."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
然后我们要修改scroll-up的修饰以及unscroll来使用这两个值。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-up</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                             activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for &#8216;</span><span style="color: #AE81FF;">unscroll</span><span style="color: #75715E;">'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span>eq last-command 'scroll-up<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">progn</span>
        <span style="color: #E6DB74;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span><span style="color: #F92672;">setq</span> unscroll-window-start <span style="color: #FD971F;">(</span>window-start<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">unscroll</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Revert to 'unscroll-point' and 'unscroll-window-start'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char unscroll-point<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>set-window-start nil unscroll-window-start<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
修饰的名称仍然是remember-for-unscroll，这会替换之前同名的修饰。<br />
</p>

<p>
函数set-window-start和goto-char移动光标位置的方式类似，它会设置窗口开始的位置。不一样的是，set-window-start有两个参数。第一个参数表明操作的是哪个窗口。如果为nil，则默认使用当前选中的窗口。（传递给set-window-start的窗口对象可以通过类似get-buffer-window以及previous-window的函数得到。）<br />
</p>

<p>
对于回滚我们可能还希望保持另一个信息，即窗口的hscroll，它保存着窗口横向翻滚的列数，默认为0 。我们可以添加另一个变量来保存：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscroll-hscroll</span> nil
  <span style="color: #75715E;">"Hscroll for next call to 'unscroll'."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
然后我们再次更新unscroll和scroll-up修饰来调用window-hscroll（获取窗口的hscroll值）以及set-window-hscroll（设置）：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-up</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                             activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span>eq last-command 'scroll-up<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">unscroll</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Revert to 'unscroll-point' and 'unscroll-window-start'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char unscroll-point<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>set-window-start nil unscroll-window-start<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>set-window-hscroll nil unscroll-hscroll<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
注意在这个scroll-up修饰的版本中，progn的使用：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">progn</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
被合并成了一个setq，里面包含了多个“变量-值”对。这是一种简化写法，setq可以包含任意数量的变量。<br />
</p>
</div>
</div>

<div id="outline-container-org1fdcf58" class="outline-3">
<h3 id="org1fdcf58"><span class="section-number-3">3.4</span> 错误检查</h3>
<div class="outline-text-3" id="text-3-4">
<p>
假如用户在调用任何scroll-up之前调用了unscroll会发生什么呢？变量unscroll-point，unscroll-window-start，以及unscroll-scroll将会包含他们的默认值，也就是nil。这个值在传递给函数goto-char，set-window-start以及set-window-scroll时是不合适的。当goto-char被调用时，unscroll的触发将会返回如下错误：“Wrong type argument: integer-or-maker-p, nil”。这表示一个函数需要接收一个数字或者标记（满足断言integer-or-marker-p），而收到的却是nil。（标记在本章前面的部分介绍过了。）<br />
</p>

<p>
为避免用户被这些神秘的错误信息所折磨，在调用goto-char之前进行一个简单的检查并且生成一个更可读的错误信息是一个好主意：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not unscroll-point<span style="color: #66D9EF;">)</span> <span style="color: #75715E;">; </span><span style="color: #75715E;">&#22914;&#26524;unscroll-point&#30340;&#20540;&#20026;nil</span>
    <span style="color: #66D9EF;">(</span><span style="color: #FD971F; font-weight: bold; font-style: italic; text-decoration: underline;">error</span> <span style="color: #E6DB74;">"Cannot unscroll yet"</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
当错误发生时，unscroll将会被终止并且提示“Cannot unscroll yet”。<br />
</p>
</div>
</div>
</div>
