3.org
* 归纳出更一般的解决方法
当我们想要按C-b时按到C-v是很常见的一种情况。这也就是我们设计unscroll函数的原因。现在让我们来研究同样容易发生的想按下M-b（backward-word）却按下了M-v（scroll-down）。这是同样的问题，但也有点不一样。如果unscroll能够回撤任何方向的滚动就好了。

最直接的方法是像修饰scroll-down那样修饰scroll-up：
#+BEGIN_SRC emacs-lisp
  (defadvice scroll-down (before remember-for-unscroll
                                 activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (eq last-command 'scroll-down))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))
#+END_SRC

（注意这两个函数，scroll-up和scroll-down，它们的修饰的名称，也就是remember-for-unscroll，可以一样，而且不会冲突。）

现在我们必须决定当错误的C-v和错误的M-v同时发生时unscroll如何运作。换句话说，假设你错误的按下了C-v C-v M-v。它是应该恢复到M-v之前的位置呢，还是应该恢复到最初的C-v之前？

我选择后者。但是这意味着对于scroll-up（以及scroll-down）的修饰，我们需要同时检测scroll-up和scroll-down。

#+BEGIN_SRC emacs-lisp
  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defadvice scroll-down (before remember-for-unscroll
                                 activate compile)
    "Remember where we started from, for 'unscroll'.'"
          (if (not (or (eq last-command 'scroll-up)
                  (eq last-command 'scroll-down)))
          (setq unscroll-point (point)
                  unscroll-window-start (window-start)
                  unscroll-hscroll (window-hscroll))))
#+END_SRC


让我们花一点时间来确保你理解表达式
#+BEGIN_SRC emacs-lisp
  (if (not (or (eq last-command 'scroll-up)
               (eq last-command 'scorll-down)))
      (setq ...))
#+END_SRC

阅读这段表达式最好的方法是一级一级的向里阅读。从这里开始
#+BEGIN_SRC emacs-lisp
  (if (not ...)
      (setq ...))
#+END_SRC

“如果为假，则设置一些变量。”下面更进一步：
#+BEGIN_SRC emacs-lisp
  (if (not (or ...))
      (setq ...))
#+END_SRC

“如果所有条件都为假，则设置一些变量。”最后，
#+BEGIN_SRC emacs-lisp
  (if (not (or (eq last-command 'scroll-up)
               (eq last-command 'scorll-down)))
      (setq ...))
#+END_SRC

表示，“如果last-command不是scroll-up并且last-command不是scroll-down，那么设置一些变量。”

假设之后你希望更多的命令也按照这种方式来修饰；例如scroll-left和scroll-right：
#+BEGIN_SRC emacs-lisp
  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for 'unscroll'. "
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)
                 (eq last-command 'scroll-left) ;new
                 (eq last-command 'scroll-right))) ;new
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defadvice scroll-down (before remember-for-unscroll
                                 activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)
                 (eq last-command 'scroll-left) ;new
                 (eq last-command 'scroll-right))) ;new
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defadvice scroll-left (before remember-for-unscroll
                                 activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)
                 (eq last-command 'scroll-left)
                 (eq last-command 'scroll-right)))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defadvice scroll-right (before remember-for-unscroll
                                  activate compile)
    "Remember where we started from, for 'unscroll'."
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)
                 (eq last-command 'scroll-left)
                 (eq last-command 'scroll-right)))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))
#+END_SRC

这样写不仅繁琐且容易出错，而且对于每个我们需要回撤的新命令，每个之前写过的回撤命令都需要加入对于新的last-command的检测。

