html/3.html

<div id="outline-container-org5fda8ce" class="outline-2">
<h2 id="org5fda8ce"><span class="section-number-2">4</span> 归纳出更一般的解决方法</h2>
<div class="outline-text-2" id="text-4">
<p>
当我们想要按C-b时按到C-v是很常见的一种情况。这也就是我们设计unscroll函数的原因。现在让我们来研究同样容易发生的想按下M-b（backward-word）却按下了M-v（scroll-down）。这是同样的问题，但也有点不一样。如果unscroll能够回撤任何方向的滚动就好了。<br />
</p>

<p>
最直接的方法是像修饰scroll-down那样修饰scroll-up：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-down</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                               activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span>eq last-command 'scroll-down<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
（注意这两个函数，scroll-up和scroll-down，它们的修饰的名称，也就是remember-for-unscroll，可以一样，而且不会冲突。）<br />
</p>

<p>
现在我们必须决定当错误的C-v和错误的M-v同时发生时unscroll如何运作。换句话说，假设你错误的按下了C-v C-v M-v。它是应该恢复到M-v之前的位置呢，还是应该恢复到最初的C-v之前？<br />
</p>

<p>
我选择后者。但是这意味着对于scroll-up（以及scroll-down）的修饰，我们需要同时检测scroll-up和scroll-down。<br />
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-up</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                             activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-down</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                               activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'.'"</span>
        <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
                <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
        <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
                unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
                unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>


<p>
让我们花一点时间来确保你理解表达式<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not <span style="color: #A6E22E;">(</span><span style="color: #F92672;">or</span> <span style="color: #E6DB74;">(</span>eq last-command 'scroll-up<span style="color: #E6DB74;">)</span>
             <span style="color: #E6DB74;">(</span>eq last-command 'scorll-down<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
阅读这段表达式最好的方法是一级一级的向里阅读。从这里开始<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not ...<span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
“如果为假，则设置一些变量。”下面更进一步：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not <span style="color: #A6E22E;">(</span><span style="color: #F92672;">or</span> ...<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
“如果所有条件都为假，则设置一些变量。”最后，<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>not <span style="color: #A6E22E;">(</span><span style="color: #F92672;">or</span> <span style="color: #E6DB74;">(</span>eq last-command 'scroll-up<span style="color: #E6DB74;">)</span>
             <span style="color: #E6DB74;">(</span>eq last-command 'scorll-down<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>
    <span style="color: #66D9EF;">(</span><span style="color: #F92672;">setq</span> ...<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
表示，“如果last-command不是scroll-up并且last-command不是scroll-down，那么设置一些变量。”<br />
</p>

<p>
假设之后你希望更多的命令也按照这种方式来修饰；例如scroll-left和scroll-right：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-up</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                             activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'. "</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-left<span style="color: #FD971F;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">new</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-right<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">new</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-down</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                               activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-left<span style="color: #FD971F;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">new</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-right<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span> <span style="color: #75715E;">;</span><span style="color: #75715E;">new</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-left</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                               activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-left<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-right<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defadvice</span> <span style="color: #A6E22E;">scroll-right</span> <span style="color: #66D9EF;">(</span>before remember-for-unscroll
                                activate compile<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Remember where we started from, for 'unscroll'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span><span style="color: #F92672;">or</span> <span style="color: #FD971F;">(</span>eq last-command 'scroll-up<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-down<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-left<span style="color: #FD971F;">)</span>
               <span style="color: #FD971F;">(</span>eq last-command 'scroll-right<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">setq</span> unscroll-point <span style="color: #E6DB74;">(</span>point<span style="color: #E6DB74;">)</span>
            unscroll-window-start <span style="color: #E6DB74;">(</span>window-start<span style="color: #E6DB74;">)</span>
            unscroll-hscroll <span style="color: #E6DB74;">(</span>window-hscroll<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
这样写不仅繁琐且容易出错，而且对于每个我们需要回撤的新命令，每个之前写过的回撤命令都需要加入对于新的last-command的检测。<br />
</p>
</div>
