3.org
** 使用this-command
有两种方法可以改善这种情况。第一种，既然每个修饰都差不多，我们可以把它们提取一下：
#+BEGIN_SRC emacs-lisp
  (defun unscroll-maybe-remember ()
    (if (not (or (eq last-command 'scroll-up)
                 (eq last-command 'scroll-down)
                 (eq last-command 'scroll-left)
                 (eq last-command 'scroll-right)))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))

  (defadvice scroll-up (before remember-for-unscroll
                               activate compile)
    "Remember where we started from, for 'unscroll'."
    (unscroll-maybe-remember))

  (defadvice scroll-down (before remember-for-unscroll
                                 activate compile)
    "'Remember where we started from, for 'unscroll'."
    (unscroll-maybe-remember))

  (defadvice scroll-left (before remember-for-unscroll
                                 activate compile)
    "Remember where we started from, for 'unscroll'."
    (unscroll-maybe-remember))

  (defadvice scroll-right (before remember-for-unscroll
                                  activate compile)
    "Remember where we started from, for 'unscroll'."
    (unscroll-maybe-remember))
#+END_SRC

第二种，不去检测n种可能的last-command值，我们可以使用一个单独的变量来保存每种情况的last-command值。

当前用户触发的命令的名称会保存在变量this-command中。实际上，last-command的值是这样得到的：当Emacs执行一个命令时，this-command保存着命令的名字；当执行完成时，Emacs会将this-command的值赋给last-command。

当命令执行时，它会改变this-command的值。当下个命令执行时，这个值会保存在last-command中。

让我们选择一个符号来代表所有可回撤的命令：例如，unscrollable。现在我们可以修改一下unscroll-maybe-remeber：
#+BEGIN_SRC emacs-lisp
  (defun unscroll-maybe-remember ()
    (setq this-command 'unscrollable)
    (if (not (eq last-command 'unscrollable))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))
#+END_SRC

调用这个函数的命令会将this-command设置为unscrollable。现在我们只需要检测一个变量而不必检测四种不同情况的last-command（也许还会更多）了。

** 符号属性
我们改进版的unscroll-maybe-remeber工作的非常好，但是（你可能已经预料到了）我们还是可以做一些改进。首先就是变量this-command和last-command并不是只有我们自己使用。它们对于Emacs Lisp解释器很重要，而Emacs的其他功能也依赖于这两个值。而我们知道，有一些使用了这些滚动函数的Emacs特性并没有修改this-commandh和last-command。而且，我们更想要一个专有的值来标识所有可回滚的命令。

这里我们引入好用的符号属性（symbol properties）。Emacs Lisp符号不只用来保存函数定义，它还有一组关联的属性列表。属性列表是一组键值映射。每个名字是一个Lisp符号，每个值可以是任意Lisp表达式。

属性使用put函数来保存，使用get函数来读取。因此，如果我们将17保存在符号a-symbol的some-property的属性中：
#+BEGIN_SRC emacs-lisp
  (put 'a-symbol 'some-property 17)
#+END_SRC

那么
#+BEGIN_SRC emacs-lisp
  (get 'a-symbol 'some-property)
#+END_SRC

将返回17 。如果我们从一个符号读取一个并不存在的属性，则返回nil。

我们可以将unscrollable作为一个属性，而不是作为一个储存this-command和last-command的值的变量。我们可以将支持返回的命令的unscrollable属性设为t：
#+BEGIN_SRC emacs-lisp
  (put 'scroll-up 'unscrollable t)
  (put 'scroll-down 'unscrollable t)
  (put 'scroll-left 'unscrollable t)
  (put 'scroll-right 'unscrollable t)
#+END_SRC

这只需要在调用unscroll-maybe-remember之前执行一次就行了。

现在如果x是scroll-up，scroll-down，scroll-left，scroll-right之中的一个的话则(get x unscrollable)会返回t。对于其他的符号，因为unscrollable属性默认未定义，所以结果为nil。

现在我们可以将unscroll-maybe-remember中的
#+BEGIN_SRC emacs-lisp
  (if (not (eq last-command 'unscrollable)) ...)
#+END_SRC

修改为
#+BEGIN_SRC emacs-lisp
  (if (not (get last-command 'unscrollable)) ...)
#+END_SRC

而且我们还可以停止将unscrollable赋值给this-command：
#+BEGIN_SRC emacs-lisp
  (defun unscroll-maybe-remember ()
    (if (not (get last-command 'unscrollable))
        (setq unscroll-point (point)
              unscroll-window-start (window-start)
              unscroll-hscroll (window-hscroll))))
#+END_SRC

