3.org
** 标记
我们能否将这段代码改的更好呢？假设你不小心按下了几次scroll-down然后你想unscroll。但是在你这么做之前，你发现了一些你想要修改的代码，然后你进行了修改。然后你再unscroll。这时屏幕并没有被正确的恢复！

这是因为编辑buffer中前面的文字将会改变所有后面的文字的位置。添加或者删除n个字符将会对所有后续的字符位置添加或减少n。因此unscroll-point和unscroll-window-start所保存的值都会被影响n（如果n为0，那么你很幸运）。

使用标记（marker）而不是unscroll-point和unscroll-window-start的绝对位置将会是一个很好的选择。标记是一种就像数字一样用来保存buffer位置的特殊对象。但是如果由于插入或者删除造成了buffer位置的更改，那么标记也会跟着更改。

既然我们要将unscroll-point和unscroll-window-start修改为标记，我们就不需要将他们初始化为nil了。我们可以使用make-marker来将它们初始化为空的标记对象：
#+BEGIN_SRC emacs-lisp
  (defvar unscrollfpoint (make-marker)
    "Cursor position for next call to 'unscroll'.")
    
  (defvar unscroll-window-start (make-marker)
    "Window start for next call to ''unscroll'.")
#+END_SRC

函数set-marker被用来设置标记的位置。
#+BEGIN_SRC emacs-lisp
  (defun unscroll-maybe-remember ()
    (if (not (get last-command 'unscrollable))
        (progn
          (set-marker unscroll-point (point))
          (set-marker unscroll-window-start (window-start))
          (setq unscroll-hscroll (window-hscroll)))))
#+END_SRC

progn又回来了，因为setq被拆分成了几个不同的函数调用。我们不对unscroll-hscroll使用标记，因为它的值并不是buffer位置。

我们并不需要重写unscroll，因为goto-char和set-window-start的参数不管是标记还是数字都会很好的工作。所以前面的定义（为了方便这里在贴一次）还是能够工作：
#+BEGIN_SRC emacs-lisp
  (defun unscroll ()
    "Revert to 'unscroll-point' and 'unscroll-window-start'."
    (interactive)
    (goto-char unscroll-point)
    (set-window-start nil unscroll-window-start)
    (set-window-hscroll nil unscroll-hscroll))
#+END_SRC
 
** 附录：关于效率
当我们定义unscroll-point和unscroll-marker时，我们创建了空的符号对象并且在每次调用unscroll-remember时复用它们，而不是每次都创建新的并且扔掉旧的。这是一种优化。这并不仅仅是说我们应该尽可能的避免这种对象创建的消耗，更多的是因为标记要比其他变量的消耗更大。每次buffer做出修改的时候标记都会跟着修改。弃用的标记最终会被垃圾回收器回收掉，但是直到那时它都会降低编辑buffer的速度。

通常，如果你想要弃用一个标记对象m（即你不需要再使用它的值了），这么做将会是很好的选择：
#+BEGIN_SRC emacs-lisp
  (set-marker m nil)
#+END_SRC


<<3-16>>[16]. 虽然在[[file:./2.org][第二章]]，我们使用了defalias将scroll-ahead和scroll-behind替代了scroll-up和scroll-down，本章我们依然使用它们之前的名称。

<<3-17>>[17]. 如果你认为not的行为看起来跟null很像，你是对的--它们就是同一个函数。它们其中一个就是另一个的别名。你使用哪个只是一个可读性方面的问题。当要检测一个列表是否为空列表时使用null。当要对一个值取反的时候使用not。
