html/3.html

<div id="outline-container-orgcc9dd04" class="outline-3">
<h3 id="orgcc9dd04"><span class="section-number-3">4.3</span> 标记</h3>
<div class="outline-text-3" id="text-4-3">
<p>
我们能否将这段代码改的更好呢？假设你不小心按下了几次scroll-down然后你想unscroll。但是在你这么做之前，你发现了一些你想要修改的代码，然后你进行了修改。然后你再unscroll。这时屏幕并没有被正确的恢复！<br />
</p>

<p>
这是因为编辑buffer中前面的文字将会改变所有后面的文字的位置。添加或者删除n个字符将会对所有后续的字符位置添加或减少n。因此unscroll-point和unscroll-window-start所保存的值都会被影响n（如果n为0，那么你很幸运）。<br />
</p>

<p>
使用标记（marker）而不是unscroll-point和unscroll-window-start的绝对位置将会是一个很好的选择。标记是一种就像数字一样用来保存buffer位置的特殊对象。但是如果由于插入或者删除造成了buffer位置的更改，那么标记也会跟着更改。<br />
</p>

<p>
既然我们要将unscroll-point和unscroll-window-start修改为标记，我们就不需要将他们初始化为nil了。我们可以使用make-marker来将它们初始化为空的标记对象：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscrollfpoint</span> <span style="color: #66D9EF;">(</span>make-marker<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Cursor position for next call to 'unscroll'."</span><span style="color: #AE81FF;">)</span>

<span style="color: #AE81FF;">(</span><span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">unscroll-window-start</span> <span style="color: #66D9EF;">(</span>make-marker<span style="color: #66D9EF;">)</span>
  <span style="color: #75715E;">"Window start for next call to ''unscroll'."</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
函数set-marker被用来设置标记的位置。<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">unscroll-maybe-remember</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">if</span> <span style="color: #A6E22E;">(</span>not <span style="color: #E6DB74;">(</span>get last-command 'unscrollable<span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span>
      <span style="color: #A6E22E;">(</span><span style="color: #F92672;">progn</span>
        <span style="color: #E6DB74;">(</span>set-marker unscroll-point <span style="color: #FD971F;">(</span>point<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span>set-marker unscroll-window-start <span style="color: #FD971F;">(</span>window-start<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span>
        <span style="color: #E6DB74;">(</span><span style="color: #F92672;">setq</span> unscroll-hscroll <span style="color: #FD971F;">(</span>window-hscroll<span style="color: #FD971F;">)</span><span style="color: #E6DB74;">)</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>

<p>
progn又回来了，因为setq被拆分成了几个不同的函数调用。我们不对unscroll-hscroll使用标记，因为它的值并不是buffer位置。<br />
</p>

<p>
我们并不需要重写unscroll，因为goto-char和set-window-start的参数不管是标记还是数字都会很好的工作。所以前面的定义（为了方便这里在贴一次）还是能够工作：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span><span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">unscroll</span> <span style="color: #66D9EF;">()</span>
  <span style="color: #75715E;">"Revert to 'unscroll-point' and 'unscroll-window-start'."</span>
  <span style="color: #66D9EF;">(</span><span style="color: #F92672;">interactive</span><span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>goto-char unscroll-point<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>set-window-start nil unscroll-window-start<span style="color: #66D9EF;">)</span>
  <span style="color: #66D9EF;">(</span>set-window-hscroll nil unscroll-hscroll<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda20e7a" class="outline-3">
<h3 id="orgda20e7a"><span class="section-number-3">4.4</span> 附录：关于效率</h3>
<div class="outline-text-3" id="text-4-4">
<p>
当我们定义unscroll-point和unscroll-marker时，我们创建了空的符号对象并且在每次调用unscroll-remember时复用它们，而不是每次都创建新的并且扔掉旧的。这是一种优化。这并不仅仅是说我们应该尽可能的避免这种对象创建的消耗，更多的是因为标记要比其他变量的消耗更大。每次buffer做出修改的时候标记都会跟着修改。弃用的标记最终会被垃圾回收器回收掉，但是直到那时它都会降低编辑buffer的速度。<br />
</p>

<p>
通常，如果你想要弃用一个标记对象m（即你不需要再使用它的值了），这么做将会是很好的选择：<br />
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #AE81FF;">(</span>set-marker m nil<span style="color: #AE81FF;">)</span>
</pre>
</div>


<p>
<a id="orgfbd84c3"></a>[16]. 虽然在<a href="./2.html">第二章</a>，我们使用了defalias将scroll-ahead和scroll-behind替代了scroll-up和scroll-down，本章我们依然使用它们之前的名称。<br />
</p>

<p>
<a id="orgd200d21"></a>[17]. 如果你认为not的行为看起来跟null很像，你是对的&#x2013;它们就是同一个函数。它们其中一个就是另一个的别名。你使用哪个只是一个可读性方面的问题。当要检测一个列表是否为空列表时使用null。当要对一个值取反的时候使用not。<br />
</p>
</div>
</div>
</div>
</div>
</body>
</html>
